twodOverset/run.NS/system/region1/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  0 	0)
    (1  0 	0)
    (1  0.1 	0)
    (0  0.1 	0)
    (0  0 	0.1)
    (1  0 	0.1)
    (1  0.1 	0.1)
    (0  0.1 	0.1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    left
    {
	type		patch;
	faces
	(
            (0 4 7 3)
	);

    }

    right
    {
	type		patch;
	faces
	(
            (2 6 5 1)
	);

    }

    others
    {
	type		empty;
	faces
	(
            (3 7 6 2)
            (1 5 4 0)
	    (0 3 2 1)
	    (4 5 6 7)
	);

    }
);

mergePatchPairs
(
);

// ************************************************************************* //
