twodOverset/run.NS/constant/region2/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    oversetPatch
    {
        type            patch;
        physicalType    Overset;
        nFaces          224;
        startFace       4592;
    }
    others
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4704;
        startFace       4816;
    }
)

// ************************************************************************* //
