twodOverset/run.NS/0/region1/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/region1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            noSlip;
    }
    right
    {
        type            noSlip;
    }

    upper
    {
        type            fixedValue;
	value		uniform (1 0 0);
    }

    lower
    {
        type            fixedValue;
	value		uniform (-1 0 0);
    }

    others
    {
        type            empty;
    }
}


// ************************************************************************* //
